{
    "main": {
      "name":"Iosif Dobos",
      "occupation":"Software Developer",
      "description":"I'm a graduate student at Technology University Dublin with a degree in Computer Science. I love to build things and discover new technologies. As part of my degree I have built individual and college projects as well which can be found on Project section by clicking the button bellow and by visting my GitHub page. Also, for more information about my work experience, skills and education click on the Resume button.",
      "image":"github_image.png",
      "bio":"I'm a graduate student at Technology University Dublin with a degree in Computer Science. I have pursue my internship at Revenue where I have been involved in three internal projects working with programming languages such as AngularJS, jQuery and Java and Jenkins to test and deploy the applications. I love to learn and explore new technologies and often amazed by how technology has grown in the recent years.",
      "contactmessage":"Here is where you should write your message to readers to have them get in contact with you.",
      "email": "iosifdobos22@gmail.com",
      "phone": "555-555-5555",
      "address":{
        "street":"Cedarwood Rise",
        "city":"Dublin",
        "state":"Ireland",
        "zip": "D11"
      },
      "website": "",
      "resumedownload":"",
      "social":[
        {
          "name":"facebook",
          "url":"http://facebook.com/bogdandobos",
          "className":"fa fa-facebook"
        },
        {
          "name":"twitter",
          "url":"http://twitter.com",
          "className":"fa fa-twitter"
        },
        {
          "name":"medium",
          "url":"http://medium.com/",
          "className":"fa fa-medium"
        },
        {
          "name":"linkedin",
          "url":"https://www.linkedin.com/in/iosif-dobos/",
          "className":"fa fa-linkedin"
        },
        {
          "name":"instagram",
          "url":"http://instagram.com/josephberelly",
          "className":"fa fa-instagram"
        },
        {
          "name":"github",
          "url":"http://github.com/IosifDobos",
          "className":"fa fa-github"
        },
        {
            "name":"gitlab",
            "url":"http://github.com/IosifDobos",
            "className":"fa fa-gitlab"
          },
        {
          "name":"skype",
          "url":"http://skype.com",
          "className":"fa fa-skype"
        }
      ]
    },
    "resume":{
      "skillmessage":"Passionate about sport. Member of FC Real Transilvania soccer team. Take part in soccer competitions. Enjoy other sports including ping pong, tennis and snooker.",
      "education":[
        {
          "school":"Technology University Dublin",
          "degree":"BSc in Computer Science",
          "graduated":"September 2020",
          "description":"Describe your experience at school, what you learned, what useful skills you have acquired etc."
        },
        {
          "school":"Access Foundation Programme TUD",
          "degree":"Special Purpose Award Level 6",
          "graduated":"September 2016",
          "description":"Describe your experience at school, what you learned, what useful skills you have acquired etc."
        },
        {
            "school":"Technical College 'Petru Poni' Roman, Romania",
            "degree":"Bacalaureate Diploma",
            "graduated":"June 2011",
            "description":"Describe your experience at school, what you learned, what useful skills you have acquired etc."
        }
      ],
      "work":[
        {
          "company":"Intern at Revenue",
          "title":"Software Developer ",
          "years":"February - August 2019",
          "description":"Being involved in multiple projects where AngularJS, JavaScript and jQuery programming language was used to developed the frontend, Java Spring boot to manage the backend where the applications was tested and deployed in Jenkins. Engaged in all phases of the software development lifecycle which include gathering business system requirements. Participated in weekly meeting discussing the stage of the projects and planning future work. Testing and debug applications to meet business needs and interacting with the third party partners in the achievement of business initiatives."
        },
        {
          "company":"IDM Construction LTD",
          "title":"Arnotts Maintenance",
          "years":"January 2016 - Present / Part-time",
          "description":"Comply with the company plans and vision and working at my best to achieve the goals. Working under time pressure as every job had to be finished before shop opens to give customers the comfort while shopping."
        },
        {
            "company":"Adrian Iacob Dry Wall LTD - Dublin",
            "title":"Supervisor",
            "years":"Summer 2015 / Part-time",
            "description":"Set goals for performance and deadlines in ways that comply with the company plan and vision. Organizing workflow and ensuring that employees understand their duties or delegated tasks. Monitoring employee productivity and providing constructive feedback and coaching."
        },
        {
            "company":"Professional Footbal Player",
            "title":"Left Middfielder",
            "years":"2011 - 2012 FC Bohemians, 2012 - 2013 FC Glasnevin, 2013 - Ongoing FC Real Transilvania",
            "description":"Taking part in many competitions as part of the club, and training hard to improve my skills and ability. Adapted to the high pressure, extremely competitive environment, and collaborated with team members to achieve team goals."
        },
        {
            "company":"Summer Together Project, Roman, Romania",
            "title":"Mentor",
            "years":"2009 - 2010",
            "description":"The Project’s goal was to provide favourable conditions for children to learn more and to behave better during summer holiday, included a program of education, culture and arts, set up especially for children with lower financial status. The main responsibility looking after group of children between six and fifteen years of age, researching for a variety of children games and other activities. During mentoring time, helped children to communicate with each other and discover the professional universe they dream of."
        }
      ],
      "skills":[
        {
          "name":"Git",
          "level":"80%"
        },
        {
          "name":"React",
          "level":"80%"
        },
        {
          "name":"CSS",
          "level":"90%"
        },
        {
          "name":"HTML5",
          "level":"80%"
        },
        {
          "name":"Java",
          "level":"75%"
        },
        {
          "name":"MongoDB",
          "level":"80%"
        }
      ]
    },
    "portfolio":{
      "projects": [
        {
          "title":"Smart-Nurse",
          "category":"App build for my final year project",
          "image":"smart-nurse.png",
          "url":"https://gitlab.com/IosifDobos/only-react-native"
        },
        {
          "title":"Iosif-Portfolio",
          "category":"React resume website",
          "image":"iosif-portfolio.png",
          "url":"https://github.com/IosifDobos/Iosif-Portfolio"
        },
        {
          "title":"JOE Medieval Game",
          "category":"3D unity game ",
          "image":"medieval-game.png",
          "url":"https://github.com/IosifDobos/JoeMedievalGame"
        },
        {
          "title":"Book Reservation Website",
          "category":"A Book Reservation website using HTML, CSS and PHP",
          "image":"library-website.jpeg",
          "url":"https://github.com/IosifDobos/Web-Development"
        },
        {
          "title":"Worldmap 2019-2020",
          "category":"Webiste that uses map location created on django framework",
          "image":"resume-website.jpg",
          "url":"https://github.com/IosifDobos/Web-Development"
        }
      ]
    },
    "testimonials":{
      "testimonials":[
        {
          "text":"Here you should write some nice things that someone has said about you. No lies though, employers can tell when you are lying.",
          "user":"Kareem Abdul Jabbar"
        },
        {
          "text":"That Iosif Dobos must be one of the most brilliant developers I've ever met! It is amazing that nobody has hired him yet. Hey you, you should hire this guy, he may be fresh out of University and have zero on the job experience but I am confident that he will be one of your best developers in no time!",
          "user":"Steve Wozniak... impersonator"
        }
      ]
    },
    "profile": {
      
    }
  }
  